tap "arl/arl"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "bat"
brew "chruby"
brew "cmake"
brew "entr"
brew "exiftool"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "gitmux"
brew "git-delta"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "guile"
brew "hashcat"
brew "lazygit"
brew "lua-language-server"
brew "mysql-client"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "openssl@1.1"
brew "p7zip"
brew "postgresql@14"
brew "protobuf"
brew "python@3.11"
brew "rbenv"
brew "ripgrep"
brew "rg"
brew "ruby-install"
brew "stow"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "wget"
brew "yazi"
brew "zoxide"
brew "arl/arl/gitmux"
brew "felixkratz/formulae/sketchybar"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "keycastr"
cask "sf-symbols"
