tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "bat"
brew "cmake"
brew "entr"
brew "exiftool"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "guile"
brew "hashcat"
brew "mysql-client"
brew "neovim"
brew "openssl@1.1"
brew "p7zip"
brew "postgresql@14"
brew "protobuf"
brew "python@3.11"
brew "rg"
brew "rust"
brew "thefuck"
brew "tldr"
brew "wget"
brew "zoxide"
