# Taps
tap "arl/arl"
tap "jandedobbeleer/oh-my-posh"

# Core tools
brew "bash"
brew "bat"
brew "entr"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "hashcat"
brew "lazygit"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "neovim"
brew "nvm"
brew "p7zip"
brew "ripgrep"
brew "stow"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autocomplete"
brew "arl/arl/gitmux"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

# Language tooling
brew "chruby"
brew "rbenv"
brew "ruby-install"
brew "python@3.11"
brew "exiftool"
brew "mysql-client"
brew "postgresql@17"
brew "protobuf"

# macOS only
if OS.mac?
  tap "felixkratz/formulae"
  tap "nikitabobko/tap"

  brew "nowplaying-cli"
  brew "switchaudio-osx"
  brew "felixkratz/formulae/borders"
  brew "felixkratz/formulae/sketchybar"

  cask "aerospace"
  cask "font-hack-nerd-font"
  cask "font-jetbrains-mono-nerd-font"
  cask "font-sf-mono"
  cask "font-sf-pro"
  cask "keycastr"
  cask "sf-symbols"
end

# Linux only
if OS.linux?
  # Add Linux-specific packages here
end
