tap "arl/arl"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
brew "automake"
brew "bash"
brew "openssl@3"
brew "bat"
brew "bison"
brew "chruby"
brew "cmake"
brew "entr"
brew "exiftool"
brew "eza"
brew "fd"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "gitmux"
brew "git-delta"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "readline"
brew "gnupg"
brew "guile"
brew "hashcat"
brew "lazygit"
brew "libffi"
brew "libyaml"
brew "xz"
brew "lua-language-server"
brew "luarocks"
brew "mysql-client"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "openssl@1.1"
brew "p7zip"
brew "postgresql@17"
brew "protobuf"
brew "python@3.11"
brew "rbenv"
brew "ripgrep"
brew "rg"
brew "ruby-install"
brew "stow"
brew "switchaudio-osx"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autocomplete"
brew "arl/arl/gitmux"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "aerospace"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "keycastr"
cask "sf-symbols"
